Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: size in time units; this can be specified using the of(Time size) method of the assigner.
zh_cn: 以时间单元表示的窗口大小。它可以利用分配器的of(Time size)方法指定。

source: size of the TaskManager memory and might suffer from garbage collection pau‐ ses.
zh_cn: 但它同样会受到TaskManager内存大小的限制，并且也可能导致垃圾回收停顿问题。

source: some records might have been written and others not.
zh_cn: 那么就会出现部分数据已经写入而部分数据没能写入的情况。

source: specifies that operators determine the current time by using information from
zh_cn: 指定算子根据数据自身的信息决定当前时间。

source: specifies that operators determine the current time of the data stream according
zh_cn: 指定算子根据处理机器的系统时钟决定数据流当前的时间。

source: specifies the processing time of the source operator as an event time timestamp
zh_cn: 指定每个接收的记录都把在数据源算子的处理时间作为事件时间的时间戳，并自动生成水位线。

source: specify a TypeSerializer to control how state is written into a state backend, check‐ point, and savepoint.2
zh_cn: 或者，你也可以显式指定一个TypeSerializer来控制状态如何写入状态后端、检查点及保存点。2

source: spends most of its time waiting for query results.
zh_cn: 因此MapFunction的大部分时间都在等待查询结果。

source: state backend stores the data serialized (like the RocksDBStateBackend) or as objects on the heap (like the FSStateBackend), this happens when the state is read by a func‐ tion or when an application is restarted from a savepoint.
zh_cn: 根据状态后端是将数据序列化后存储（如RocksDBStateBackend）还是以堆中对象的形式存储（如FSStateBackend），反序列化过程可能发生在函数读取状态时或应用从保存点重启时。

source: state depending on how the offsets should be distributed to parallel task instances in the case of a rescaled application.
zh_cn: 具体选择要根据应用扩缩容时偏移值在并行任务实例上的分配规则来决定。

source: state.backend.local-recovery: This flag enables or disables local recovery.
zh_cn: state.backend.local-recovery：用于启用或禁用本地恢复。

source: states, and side outputs to emit records.
zh_cn: 以及用于发出数据的副输出。

source: stream of integers so that all negative numbers are sent to the first task and all other numbers are sent to a random task:
zh_cn: 以下示例对一个整数数据流进行了分区，所有负数会定向发往第一个任务，而其他数字会随机选择一个任务发送：

source: stream processing benchmark, which is based on a stream of advertisement clicks that need to be enriched with details about their corresponding campaign that are stored in a key-value store.
zh_cn: 一个例子就是著名的Yahoo!流处理基准测试，它需要使用键值存储中的广告详细信息去丰富一条广告点击数据流。

source: streams can be ingested from sources such as message queues or files, or also be gen‐ erated on the fly.
zh_cn: 这些数据流的来源可以是消息队列或文件，也可以是实时生成的。

source: support to register timers are the Trigger interface for windows and the process function.
zh_cn: 只有窗口的Trigger接口以及处理函数才支持注册计时器。

source: tain information about the events they have received before.
zh_cn: 相反，状态化算子可能需要维护之前接收的事件信息。

source: task-manager-deployment.yaml.template configures the worker container as a Kubernetes deployment.
zh_cn: task-manager-deployment.yaml.template将工作容器配置为Kubernetes Deployment。

source: taskmanager.state.local.root-dirs: This parameter specifies one or more local paths at which the local state copies are stored.
zh_cn: taskmanager.state.local.root-dirs：该参数用于指定用于存储本地状态副本的一个或多个本地路径。

source: tasks but will be chained to succeeding tasks if the requirements for chaining are met.
zh_cn: 但可以在满足链接条件时和链接到后续任务。

source: tem only provides a synchronous client, you can spawn threads to send requests and handle them.
zh_cn: 而如果外部系统只提供了同步客户端，你可以通过多线程的方式来发送请求并对其进行处理。

source: temperature measured by a sensor changes by more than a threshold since the last measurement.
zh_cn: 该示例应用会在传感器测量的温度和前一个测量值相比变化超出一定阈值时发出警报。

source: template files and configured required values, you can deploy the application to Kubernetes as before with kubectl:
zh_cn: 一旦将模板文件复制好并完成必要配置，你就可以像之前那样使用kubectl将应用部署到Kubernetes上：

source: tering function state with Flink’s runtime and returning the state objects, such as ValueState, ListState, or BroadcastState.
zh_cn: 这两个状态存储（state store）对象能够使用Flink运行时来注册函数状态并返回状态对象（例如ValueState、ListState或BroadcastState）。

source: that is used if no explicit trigger is specified.
zh_cn: 用于没有显式指定触发器的情况。

source: that process them in order of the modification timestamp of the file.
zh_cn: 这些读取器会按照文件修改时间的顺序处理它们。

source: that, the method compares the temperatures, possibly emits an alert, and updates its
zh_cn: 随后，方法就会比较两个相邻的温度值，依照逻辑决定是否发出警报，并更新最近一次温度的状态。

source: the JAR file to the master process, which distributes it to the worker nodes.
zh_cn: 客户端会将JAR包提交到主进程，随后再由主进程分发至工作节点。

source: the Maximum Parallelism of Keyed State Operators”.)
zh_cn: （见"为使用键值分区状态的算子定义最大并行度"。）

source: the aggregation—a single value of the ReduceFunction’s input (and output) type.
zh_cn: 一个和ReduceFunction的输入及输出类型都相同的值。

source: the application logic might require that all tasks of an operation receive the same data or that events be distributed following a custom strategy.
zh_cn: 也可能是应用逻辑要求某操作的所有任务接收相同的数据，或按照自定义策略分发事件。

source: the isolation.level property) to declare whether it can read uncommitted mes‐ sages (read_uncommitted, the default) or not (read_committed).
zh_cn: 针对某一主题的消费者可以通过隔离级别配置（isolation.level属性）来声明自己可以读取未提交的消息（read_uncommitted，默认配置）还是不可以（read_committed）。

source: the java binary is not on the PATH, the base folder of a Java installation can be speci‐ fied by exporting the JAVA_HOME environment variable or setting the env.java.home parameter in ./conf/flink-conf.yaml.
zh_cn: 如果PATH环境变量中没有配置Java二进制文件所在目录，你可以通过导出（export）JAVA_HOME环境变量或在./conf/flink-conf.yaml中设置env.java.home参数的方式来指定Java安装根目录。

source: the method updates the clean-up timer by deleting the previous timer and registering a new one.
zh_cn: 该方法会通过删除已有计时器并注册新计时器的方法达到"延期清理"的目的。

source: the operator state as a list of serializable state objects.
zh_cn: 该方法需要将算子状态以可序列化状态对象列表的形式返回。

source: the reading position and emits records in a block that synchronizes on a lock object,
zh_cn: 为此，可以通过SourceContext.getCheckpointLock()方法获取一个锁对象，并用它对run()方法中推进偏移和发出数据的代码块进行同步处理。

source: the result of the function or an exception.
zh_cn: 第二个参数是用来返回函数结果或异常的回调对象。

source: the stateful function is restarted to recover from a failure or when an application is started from a savepoint.
zh_cn: 该情况可能在状态化函数进行故障恢复或应用从保存点开始执行时出现。

source: them in “Defining Keys and Referencing Fields” on page 102.
zh_cn: 我们会在102页"定义键值和引用字段中"介绍它们。

source: then start querying the state of the running streaming application.
zh_cn: 这时候，仪表盘就会开始从运行的流式应用中查询状态。

source: timeout.9 Hence, it does not offer definitive exactly-once guarantees even though it implements the TwoPhaseCommitSinkFunction interface.
zh_cn: 因此它即便实现了TwoPhaseCommitSinkFunction类，也无法完美地提供精确一次的保障。

source: timestamp is stored in an additional ValueState[Long] called lastTimerState.
zh_cn: KeyedProcessFunction会使用一个名为lastTimerState的ValueState[Long]来记录它的时间。

source: timestamp larger than the timestamp of the previous watermark, the new watermark
zh_cn: 且它的时间戳大于上一个水位线的时间戳，那么算子就会发出一个新的水位线。

source: tion performs the actual window evaluation.
zh_cn: 而实际的计算逻辑则由窗口函数决定。

source: tion via the StreamExecutionEnvironment or per operator using the setMaxParallel ism() method as shown in Example 7-11.
zh_cn: 如示例7-11所示，我们可以通过StreamExecutionEnvironment为应用的所有算子设置最大并行度或利用算子的setMaxParallelism()方法为每个算子单独设置。

source: tioned before, the connector might lose data if a transaction is rolled back due to a
zh_cn: 如前所述，该连接器可能会因为事务超时回滚而丢失数据。9

source: tions, mixes up the timestamp order of the elements.
zh_cn: 都会导致元素的时间戳混乱。

source: to ResultFuture is a lightweight operation that does not require a dedicated thread.
zh_cn: 因为将结果传递给ResultFuture对象是一个相对轻量级的操作，我们无须为它分配一个单独的线程。

source: to connect to the source of the sensor measurements and create an initial DataStream of type SensorReading.
zh_cn: 来连接传感器测量源，并创建出SensorReading类型的初始DataStream。

source: to ensure the broadcast state holds the same information in all parallel instances.
zh_cn: 这其实是一种安全机制，用于确保所有并行实例中广播状态所保存的信息完全相同。

source: to initialize the state by checking if the state backend holds state for the function reg‐ istered under the given name.
zh_cn: 状态存储首先会利用给定名称检查状态后端中是否存在一个为当前函数注册过的同名状态，并尝试用它对状态进行初始化。

source: to instruct our program to interpret time semantics using event time.
zh_cn: 来指定程序使用事件时间来解释时间语义。

source: topic to which the data is written, and the last is a SerializationSchema that con‐ verts the input types of the sink (String in Example 8-2) into a byte array.
zh_cn: 最后一个参数SerializationSchema用于将数据汇的输入类型（示例8-2中的是String）转换为字节数组。

source: tor from being chained to preceding and succeeding tasks (Example 10-1).
zh_cn: 这会让算子的任务不会和前后的其他任务进行链接（示例10-1）。

source: tors collect and process records with possibly unordered timestamps and finalize a computation when their event-time clock, which is advanced by the received water‐ marks, indicates that no more records with relevant timestamps are expected.
zh_cn: 对基于时间的算子任务而言，其收集和处理的记录可能会包含乱序的时间戳。这些算子只有当自己的事件时间时钟（由接收的水位线驱动）指示不必再等那些包含相关时间戳的记录时，才会最终触发计算。

source: tors, you can override the processLatencyMarker() method and retrieve the relevant information using the LatencyMarker’s methods getMarkedTime(), getVertexId(), and getSubTaskIndex().
zh_cn: 可以覆盖processLatencyMarker()方法，在其中使用LatencyMarker的getMarkedTime()、getVertexId()和getSubTaskIndex()方法获取相关信息。

source: trigger does not support merging it cannot be used in combination with a Merging WindowAssigner.
zh_cn: 如果一个触发器不支持合并，则无法与MergingWindowAssigner组合使用。

source: truth because it persists the input events and can replay them in an deterministic order.
zh_cn: 这缘于于它可以持久化输入事件并以确定顺序将其重放。

source: type information to represent data types and generate specific serializers, deserializ‐ ers, and comparators for every data type.
zh_cn: Flink利用类型信息的概念来表示数据类型，并且对于每种类型，都会为其生成特定的序列化器、反序列化器以及比较器。

source: types of filesystems, such as local filesystems (including locally mounted NFS or SAN shares, Hadoop HDFS, Amazon S3, and OpenStack Swift FS).
zh_cn: Flink支持多种类型的文件系统，例如：本地文件系统（包括挂载到本地的NFS或SAN），Hadoop HDFS，Amazon S3以及OpenStack Swift FS。

source: typically via a start offset and a length.
zh_cn: 该范围通常由起始偏移和长度来决定。

source: ured using the state.backend.rocksdb.localdir key.
zh_cn: 其维护目录可以利用state.backend.rocksdb.localdir参数来设置。

source: used with care.
zh_cn: 因此使用时要格外小心。

source: user@flink.apache.org : user support and questions
zh_cn: user@flink.apache.org：用户支持和问题提问

source: val bound: Long = 60 * 1000 // 1 min in ms
zh_cn: val bound: Long = 60 * 1000 // 1分钟的毫秒数

source: val input: DataStream[(Int, String, Long)] = ... val keyed1 = input.keyBy("2") // key by 3rd field val keyed2 = input.keyBy("_1") // key by 1st field
zh_cn: val input: DataStream[(Int, String, Long)] = ... val keyed1 = input.keyBy("2") // 以第3个字段为键值 val keyed2 = input.keyBy("_1") // 以第1个字段为键值

source: val persons: DataStream[Person] = ... persons.keyBy("address.zip") // key by nested POJO field
zh_cn: val persons: DataStream[Person] = ... persons.keyBy("address.zip") // 以嵌套的POJO字段为键值

source: var maxTs: Long = Long.MinValue // the maximum observed timestamp
zh_cn: var maxTs: Long = Long.MinValue // 观察到的最大时间戳

source: viii | Table of Contents
zh_cn: viii | 目录

source: watermarks and checkpoint barriers remain aligned.
zh_cn: 而unorderWait()中的异步算子只能让水位线和检查点分隔符保持对齐。

source: way to perform a lightweight load rebalance when the number of sender and receiver tasks is not the same.
zh_cn: 本质上看，重调分区策略为发送端和接收端任务不等的情况提供了一种轻量级的负载均衡方法。

source: when to time out the asynchronous call for a record and how many concurrent requests to start.
zh_cn: 其他参数包括异步调用的超时时间以及请求的并发上限等。

source: whether a 2PC sink function provides such guarantees or not depends on the imple‐ mentation details.
zh_cn: 但这种2PC数据汇函数对于保障的支持与否并非取决于它的实现细节。

source: which is used in the entry point of the container to adjust Flink’s configuration.
zh_cn: 该变量会以ENTRYPOINT的方式传给容器，用于调整Flink的配置。

source: will move all data to a single task such that the operator would be
zh_cn: 注意，该操作会使所有数据发送到单个任务上，

source: window to perform more complex computations, such as computing the median of values in a window or the most frequently occurring value.
zh_cn: 然而有些时候我们需要访问窗口内的所有元素来执行一些更加复杂的计算，例如计算窗口内数据的中值或出现频率最高的值。

source: window using the timeWindow(size) method, which is a shortcut for either window.
zh_cn: 该方法是对window.(TumblingEventTimeWindows.of(size))或window.(TumblingProcessing TimeWindows.of(size))的简写，

source: windows is defined by a set of policies.
zh_cn: 窗口的行为是由一系列策略定义的，

source: window’s start and end timestamp and the minimum and maximum temperature.
zh_cn: 其中包含了窗口的开始、结束时间以及窗口内的最低、最高温度。

source: with the same key access the same state and thus can be processed together.
zh_cn: 这意味着所有键值相同的事件可以访问相同的状态，因此它们可以被一并处理。

source: writes all following records to the sink system in the context of the current trans‐ action.
zh_cn: 并以当前事务为上下文将所有后续记录写入数据汇系统。

source: x | Preface
zh_cn: x | 序言

source: xii | Preface
zh_cn: xii | 序言

source: yarn-cluster, the client submits the job to the YARN cluster as identified by the
zh_cn: 如果加上关键字"yarn-cluster"，客户端会将作业提交到由Hadoop配置所指定的YARN集群上。

source: you can automatically set it with the following command if the hadoop command is accessible: export HADOOP_CLASSPATH=`hadoop classpath`.
zh_cn: 则可以在能访问hadoop命令的前提下，通过以下指令自动设置该变量：export HADOOP_CLASSPATH=`hadoop classpath`。

source: you have to create a new backend object by passing a Configuration object to your
zh_cn: 为此，你必须在创建状态后端对象时将一个Configuration对象传给它

source: you still need to generate watermarks and should apply an AssignerWithPeriodicWa termark or an AssignerWithPunctuatedWatermark that forwards the previously assigned Kafka timestamp.
zh_cn: 这种情况下，你仍然需要生成水位线，并利用AssignerWithPeriodicWatermark或AssignerWithPunctuatedWatermark来转发之前分配的Kafka时间戳。

source: —hdfs://nnode1:50010 and hdfs://nnode2:50010 are separately tracked.
zh_cn: 例如，hdfs://nnode1:50010和hdfs://nnode2:50010会分别追踪。

source: “Checkpoint‐ ing and State Backends” on page 243 describes how you can configure a default state backend of a Flink cluster.
zh_cn: 我们第243页"检查点和状态后端"一节介绍了如何为Flink集群配置默认状态后端。

source: “Integration with Hadoop Components” on page 236 describes the required configuration in detail.
zh_cn: 配置详情请见第236页"集成Hadoop组件"。

source: “Integration with Hadoop Components” on page 236 explains how to ensure Hadoop depen‐ dencies are loaded.
zh_cn: 详细内容请参阅"集成Hadoop组件"一节。

source: “Managing Applications with the Command-Line Client” on page 247 provides more details about some of the operations, such as upgrading or scaling an application.
zh_cn: 第247页"通过命令行客户端管理应用"一节提供了有关某些操作的更多详情，例如升级应用或对应用进行扩缩容。

source: “Scaling Stateful Operators” on page 56 discusses key groups and how keyed state is scaled out and in.
zh_cn: 第56页"状态化算子扩缩容"一节已经对键值组和键值状态的伸缩规则进行了介绍。
